
$(function(){
  createNumberOfGroupsOptions();

  $(".values").tooltip({
    trigger: "manual",
    placement: "right"
  });
  
  $("#all-countries").on('change', function(){
    if($(this).is(":checked")) {
      showValues(AllCountries);
    }
  });
  
  $("#all-states").on('change', function(){
    if($(this).is(":checked")){
      showValues(AllStates);      
    }
  });
  
  $("#other").on('change', function(){
    if($(this).is(":checked")) {
      showValues(null); 
    }
  });
  
  $(".values").on("change input", function(){
    var text = $(this).val(); 
    if(text == "") {
      $(".lines-count").text("");
    } else {
      var lines = text.split(/\r|\r\n|\n/).filter(function(s){ return s !== ''; });
      $(".lines-count").text("("+lines.length+") ");
    }
  });
  
  $(".start-btn").click(draw);
  
  showValues(AllCountries);
});

function createNumberOfGroupsOptions() {
  var i = 1;
  while(i++ < 11) {
    $(".number-of-groups").append($("<option value='" + i + "'" + (i == 4 ? "selected" : "") + ">" + i + " штук" + (i > 4 ? "" : "и") + "</option>"))
  }
}

function showValues(values){
  var textArea = $(".values");
  if(values == null){
    textArea.val("").change();
    textArea.tooltip("show");
  } else {
    textArea.val(values.join("\n")).change();
    textArea.tooltip("hide");
  }
}

function draw() {
  var values = $(".values").val().split("\n").filter(function(s){ return s !== ''; });
  var groupSize = parseInt($(".number-of-groups").val());
  var resultsDiv = $(".results");
  
  shuffle(values);
  var groups = split(values, groupSize);
  resultsDiv.html("");
  
  var i, j;
  for (i = 0; i < groups.length; i++) {
    var html = "<div class='result-group col'><ul class='list-group'>";
    for (j = 0; j < groups[i].length; j++) {
      html += "<li class='list-group-item'>" + groups[i][j] + "</li>";
    }
    html += "</ul></div>";
    resultsDiv.append($(html));
  }
}

function shuffle(values) {
	var i, temp, j;
	var count = values.length
  
  for (i = 0; i < count; i++) {
		j = ~~(Math.random() * count);
		temp = values[i];
		values[i] = values[j];
		values[j] = temp;
	}
	
  return values;
}

function split(values, groupSize){
    var result = [];
    
    while (values.length) {
        result.push(values.splice(0, groupSize));
    }
  
    if(result.length > 1 
       && result[result.length - 1].length < groupSize) {
      result[result.length - 2] = result[result.length - 2].concat(result[result.length - 1]);
      result.pop();
    }
    
    return result;
}

const AllStates = [
"Айдахо",
"Айова",
"Алабама",
"Аляска",
"Аризона",
"Арканзас",
"Вайоминг",
"Вашингтон",
"Вермонт",
"Вирджиния",
"Висконсин",
"Гавайи",
"Делавэр",
"Джорджия",
"Западная Вирджиния",
"Иллинойс",
"Индиана",
"Калифорния",
"Канзас",
"Кентукки",
"Колорадо",
"Коннектикут",
"Луизиана",
"Массачусетс",
"Миннесота",
"Миссисипи",
"Миссури",
"Мичиган",
"Монтана",
"Мэн",
"Мэриленд",
"Небраска",
"Невада",
"Нью-Гэмпшир",
"Нью-Джерси",
"Нью-Йорк",
"Нью-Мексико",
"Огайо",
"Оклахома",
"Орегон",
"Пенсильвания",
"Род-Айленд",
"Северная Дакота",
"Северная Каролина",
"Теннесси",
"Техас",
"Флорида",
"Южная Дакота",
"Южная Каролина",
"Юта"
];

const AllCountries = [
"Афганистан",
"Австралия",
"Австрия",
"Азербайджан",
"Албания",
"Алжир",
"Ангола",
"Андорра",
"Антигуа и Барбуда",
"Аргентина",
"Армения",
"Багамы",
"Бангладеш",
"Барбадос",
"Бахрейн",
"Белиз",
"Белоруссия",
"Бельгия",
"Бенин",
"Бирма/Мьянма",
"Болгария",
"Боливия",
"Босния и Герцеговина",
"Ботсвана",
"Бразилия",
"Бруней",
"Буркина-Фасо",
"Бурунди",
"Бутан",
"Вануату",
"Ватикан",
"Венгрия",
"Венесуэла",
"Восточный Тимор",
"Вьетнам",
"Габон",
"Гаити",
"Гайана",
"Гамбия",
"Гана",
"Гватемала",
"Гвинея",
"Гвинея-Бисау",
"Германия",
"Гондурас",
"Гренада",
"Греция",
"Дания",
"Джибути",
"Джорджия",
"Доминика",
"Доминиканская Республика",
"Египет",
"Замбия",
"Западная Сахара",
"Зимбабве",
"Израиль",
"Индия",
"Индонезия",
"Иордания",
"Ирак",
"Иран",
"Ирландия",
"Исландия",
"Испания",
"Италия",
"Йемен",
"Кабо-Верде",
"Казахстан",
"Камбоджа",
"Камерун",
"Канада",
"Катар",
"Кения",
"Кипр",
"Кирибати",
"Китай",
"Колумбия",
"Коморские острова",
"Конго",
"Конго, демократическая республика",
"Корея, север",
"Корея, юг",
"Коста-Рика",
"Кот-д'Ивуар / Кот-д'Ивуар",
"Куба",
"Кувейт",
"Кыргызстан",
"Лаос",
"Латвия",
"Лесото",
"Либерия",
"Ливан",
"Ливия",
"Литва",
"Лихтенштейн",
"Люксембург",
"Маврикий",
"Мавритания",
"Мадагаскар",
"Македония",
"Малави",
"Малайзия",
"Мали",
"Мальдивы",
"Мальта",
"Марокко",
"Маршалловы Острова",
"Мексика",
"Микронезия",
"Мозамбик",
"Молдова",
"Монако",
"Монголия",
"Намибия",
"Науру",
"Непал",
"Нигер",
"Нигерия",
"Нидерланды",
"Никарагуа",
"Новая Зеландия",
"Норвегия",
"Объединенные Арабские Эмираты",
"Оман",
"Пакистан",
"Палау",
"Палестина",
"Панама",
"Папуа - Новая Гвинея",
"Парагвай",
"Перу",
"Польша",
"Португалия",
"Российская Федерация",
"Руанда",
"Румыния",
"Сальвадор",
"Самоа",
"Сан-Марино",
"Сан-Томе и Принсипи",
"Саудовская Аравия",
"Свазиленд",
"Сейшельские острова",
"Сенегал",
"Сент-Винсент и Гренадины",
"Сент-Китс и Невис",
"Сент-Люсия",
"Сербия",
"Сингапур",
"Сирия",
"Словакия",
"Словения",
"Соединенное Королевство",
"Соединенные Штаты",
"Соломоновы Острова",
"Сомали",
"Судан",
"Суринам",
"Сьерра-Леоне",
"Таджикистан",
"Таиланд",
"Танзания",
"Того",
"Тонга",
"Тринидад и Тобаго",
"Тувалу",
"Тунис",
"Туркмения",
"Турция",
"Уганда",
"Узбекистан",
"Украина",
"Уругвай",
"Фиджи",
"Филиппины",
"Финляндия",
"Франция",
"Хорватия",
"Центральноафриканская Республика",
"Чад",
"Черногория",
"Чешская Республика",
"Чили",
"Швейцария",
"Швеция",
"Шри-Ланка",
"Эквадор",
"Экваториальная Гвинея",
"Эритрея",
"Эстония",
"Эфиопия",
"Южная Африка",
"Южный Судан",
"Ямайка",
"Япония"
];